soap/miniupnp/miniupnpd-2.1-igd2/seeds/X54_WANIPC-AddPortMapping_4

<?xml version="1.0" encoding="UTF-8"?><s:Envelope s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" ><s:Body><u:AddPortMapping xmlns:u="urn:schemas-upnp-org:service:WANIPConnection:1"><NewRemoteHost>1.1.1.1</NewRemoteHost><NewExternalPort>36349</NewExternalPort><NewProtocol>TCP</NewProtocol><NewInternalPort>3166</NewInternalPort><NewInternalClient>127.0.0.1</NewInternalClient><NewEnabled>1</NewEnabled><NewPortMappingDescription>r@i1wwKRwO7301j.</NewPortMappingDescription><NewLeaseDuration>301168225</NewLeaseDuration></u:AddPortMapping></s:Body></s:Envelope>
